Repository: AdityaPawar1408/Crop-Disease-Detction
Catalog: locale/*/LC_MESSAGES/django.po
Languages: mr

source: CropCare
mr: पीकआरोग्य

source: AI Disease Detection
mr: AI रोग शोधन

source: Home
mr: होम

source: Scan
mr: स्कॅन करा

source: History
mr: इतिहास

source: Help
mr: मदत

source: CropCare Assistant
mr: पीकआरोग्य सहाय्यक

source: Hi! How can I help you with your crop health today?
mr: नमस्कार! मी आज तुमच्या पिकाच्या आरोग्यासाठी कशी मदत करू शकतो?

source: Ask a question...
mr: प्रश्न विचारा...

source: Scan History
mr: स्कॅन इतिहास

source: Date
mr: तारीख

source: Crop Type
mr: पिकाचा प्रकार

source: Disease Detected
mr: आढळलेला रोग

source: Confidence
mr: विश्वास

source: Severity
mr: तीव्रता

source: Action
mr: कृती

source: View Details
mr: तपशील पहा

source: No history records found. Start scanning new leaves!
mr: कोणतेही इतिहास रेकॉर्ड आढळले नाही. नवीन पाने स्कॅन करणे सुरू करा!

source: Full Scan History
mr: संपूर्ण स्कॅन इतिहास

source: Review all past disease detection analyses.
mr: मागील सर्व रोग निदान विश्लेषणांचे पुनरावलोकन करा.

source: Start New Scan
mr: नवीन स्कॅन सुरू करा

source: AI-Powered Detection
mr: AI-समर्थित निदान

source: Protect Your Crops with
mr: आपल्या पिकांचे रक्षण करा

source: Upload a photo of your crop leaf and get instant disease detection results with treatment recommendations powered by advanced AI technology.
mr: आपल्या पिकाच्या पानाचा फोटो अपलोड करा आणि प्रगत AI तंत्रज्ञानाने समर्थित उपचार शिफारसींसह त्वरित रोग निदान परिणाम मिळवा.

source: Upload Leaf Image
mr: पानाचे चित्र अपलोड करा

source: Take Photo
mr: फोटो घ्या

source: Diseases Detected
mr: आढळलेले रोग

source: Accuracy Rate
mr: अचूकता दर

source: Farmers Helped
mr: शेतकऱ्यांची मदत

source: How CropCare Works
mr: पीकआरोग्य कसे कार्य करते

source: Simple, fast, and accurate crop disease detection in three easy steps
mr: तीन सोप्या चरणांमध्ये साधे, जलद आणि अचूक पीक रोग निदान

source: Instant Detection
mr: झटपट निदान

source: Upload or capture crop images for immediate AI analysis.
mr: त्वरित AI विश्लेषणासाठी पिकाचे चित्र अपलोड करा किंवा कॅप्चर करा.

source: High Accuracy
mr: उच्च अचूकता

source: Advanced AI models trained on thousands of crop images.
mr: हजारो पिकांच्या चित्रांवर प्रशिक्षित केलेले प्रगत AI मॉडेल.

source: Treatment Advice
mr: उपचार सल्ला

source: Get personalized treatment recommendations for detected diseases.
mr: आढळलेल्या रोगांसाठी वैयक्तिकृत उपचार शिफारसी मिळवा.

source: Ready to Protect Your Crops?
mr: आपले पीक संरक्षित करण्यास तयार आहात?

source: Join thousands of farmers using AI to detect crop diseases early
mr: रोगांचे लवकर निदान करण्यासाठी हजारो शेतकऱ्यांमध्ये सामील व्हा

source: Start Scanning Now
mr: आता स्कॅनिंग सुरू करा

source: Disease Detection Dashboard
mr: रोग निदान डॅशबोर्ड

source: AI-powered analysis results for your crop
mr: आपल्या पिकासाठी AI-समर्थित विश्लेषण परिणाम

source: Analysis Failed
mr: विश्लेषण अयशस्वी

source: Please try scanning a different image.
mr: कृपया एक वेगळी प्रतिमा स्कॅन करण्याचा प्रयत्न करा.

source: Original Image
mr: मूळ प्रतिमा

source: Crop Detected
mr: पीक आढळले

source: Confidence Score
mr: विश्वास स्कोअर

source: Severity Level
mr: तीव्रता स्तर

source: Health Status
mr: आरोग्य स्थिती

source: Analysis Date
mr: विश्लेषण तारीख

source: Treatment Recommendations
mr: उपचार शिफारसी

source: priority
mr: प्राधान्य

source: No specific recommendations available.
mr: कोणतीही विशिष्ट शिफारस उपलब्ध नाही.

source: Prevention Tips
mr: प्रतिबंधक उपाय

source: No specific prevention tips available for this crop.
mr: या पिकासाठी कोणतीही विशिष्ट प्रतिबंध टिपा उपलब्ध नाहीत.

source: Quick Actions
mr: त्वरित क्रिया

source: Scan Another Leaf
mr: एक वेगळी पान स्कॅन करा

source: Download Report
mr: अहवाल डाउनलोड करा

source: Share Results
mr: परिणाम सामायिक करा

source: View Full History
mr: संपूर्ण इतिहास पहा

source: Emergency Contact
mr: आपत्कालीन संपर्क

source: For severe disease outbreaks or urgent farming advice:
mr: गंभीर रोग प्रादुर्भाव किंवा तातडीच्या कृषी सल्ल्यासाठी:

source: Contact Agricultural Expert
mr: कृषी तज्ञांशी संपर्क साधा

source: Available 24/7 for emergencies
mr: आपत्कालीन परिस्थितीसाठी 24/7 उपलब्ध

source: Disease Probability
mr: रोगाची शक्यता

source: Probability data available.
mr: संभाव्यता डेटा उपलब्ध आहे.

source: Upload Crop Image
mr: पीक प्रतिमा अपलोड करा

source: Upload a clear photo of a crop leaf for AI disease detection
mr: AI रोग निदानासाठी पिकाच्या पानाचा स्पष्ट फोटो अपलोड करा

source: Take a Photo or Upload a Leaf
mr: फोटो घ्या किंवा पान अपलोड करा

source: Start Camera
mr: कॅमेरा सुरू करा

source: Capture Photo
mr: फोटो कॅप्चर करा

source: Browse File
mr: फाईल ब्राउझ करा

source: Photo Guidelines
mr: फोटो मार्गदर्शक तत्त्वे

source: Take clear, well-lit photos of individual leaves
mr: स्वतंत्र पानांचे स्पष्ट, चांगले प्रकाशित फोटो घ्या

source: Ensure the leaf fills most of the frame
mr: पान फ्रेमच्या बहुतेक भागात भरलेले असल्याची खात्री करा

source: Include both healthy and affected areas if visible
mr: दृश्यमान असल्यास निरोगी आणि प्रभावित दोन्ही भाग समाविष्ट करा

source: Avoid blurry or heavily shadowed images
mr: अस्पष्ट किंवा जास्त गडद सावली असलेल्या चित्रांपासून दूर रहा

source: Supported Crops
mr: समर्थित पिके

source: Tomato, Potato, Corn, Wheat, Rice, Cotton, Soybean, and many more
mr: टोमॅटो, बटाटा, मका, गहू, तांदळ, कापूस, सोयाबीन आणि बरेच काही

source: Stop Camera
mr: कॅमेरा थांबवा

source: Could not access camera. Please check permissions.
mr: कॅमेऱ्यात प्रवेश करता आला नाही. कृपया परवानग्या तपासा.

source: The leaf is healthy. No disease detected. Keep up the good work!
mr: पान निरोगी आहे. कोणताही रोग आढळला नाही. चांगले काम चालू ठेवा!

source: Apply water regularly.
mr: नियमितपणे पाणी द्या.

source: Monitor plant daily for early signs of disease.
mr: रोगाच्या प्रारंभिक लक्षणांसाठी दररोज पिकाचे निरीक्षण करा.

source: Monitor closely for pests and new disease symptoms.
mr: कीटक आणि नवीन रोग लक्षणांसाठी लक्षपूर्वक निरीक्षण करा.

source: Maintain optimal soil moisture and nutrient levels.
mr: मातीची सर्वोत्तम आर्द्रता आणि पोषण पातळी राखा.

source: Ensure adequate spacing for good air circulation.
mr: चांगल्या वायुवीजनासाठी पुरेशी जागा सुनिश्चित करा.

source: Caused by fungus Alternaria solani. Symptoms: dark spots, yellowing leaves.
mr: फंगस अल्टरनेरिया सोलानीमुळे होतो. लक्षणे: काळे ठिपके, पिवळ्या पानांचे.

source: Apply approved copper fungicide (e.g., Chlorothalonil) immediately.
mr: तत्काळ मान्यताप्राप्त तांब्याचा फंगिसाइड (उदा. क्लोरोथालोनिल) लागू करा.

source: Ensure good air circulation around the plants.
mr: पिकांच्या आजूबाजूच्या वायुवीजनाची चांगली खात्री करा.

source: Avoid overhead watering.
mr: ओव्हरहेड पाण्याचा वापर टाळा.

source: Practice crop rotation every 2-3 years.
mr: प्रत्येक 2-3 वर्षांनी पिकांची फेरफार करा.

source: Destroy infected plant debris immediately after harvest.
mr: कापणीनंतर लगेच संक्रमित वनस्पतींचे अवशेष नष्ट करा.

source: Avoid working in the garden when leaves are wet.
mr: पानं ओलसर असताना बागेत काम करण्यास टाळा.

source: Caused by Phytophthora infestans. Symptoms: brown lesions, rotting. Urgent action required!
mr: फायटोप्थोरा इन्फेस्टन्समुळे होतो. लक्षणे: तपकिरी lesions, सडणे. तातडीची कारवाई आवश्यक आहे!

source: Immediately remove and destroy infected plant parts.
mr: तत्काळ संक्रमित वनस्पतींचे भाग काढा आणि नष्ट करा.

source: Apply systemic fungicide (e.g., Mancozeb).
mr: सिस्टम फंगिसाइड (उदा. मॅनकोझेब) लागू करा.

source: Monitor neighboring plants closely.
mr: शेजारील पिकांचे लक्षपूर्वक निरीक्षण करा.

source: Use certified disease-free potato seed.
mr: प्रमाणित रोगमुक्त बटाटा बियाणे वापरा.

source: Apply preventive fungicide sprays during wet or humid weather.
mr: ओलसर किंवा आर्द्र हवामानात प्रतिबंधात्मक फंगिसाइड स्प्रे लागू करा.

source: Improve drainage and avoid excessive nitrogen fertilizer.
mr: निचरा सुधारित करा आणि अति नायट्रोजन खत टाळा.

source: Hi there! How can I help you today?
mr: नमस्कार! मी आज तुमची कशी मदत करू शकतो?

source: For healthy plants: Apply water regularly and monitor daily for early signs of disease.
mr: निरोगी वनस्पतींसाठी: नियमितपणे पाणी द्या आणि रोगाच्या सुरुवातीच्या लक्षणांसाठी दररोज निरीक्षण करा.

source: Late Blight: This is a serious disease. Immediately remove and destroy infected plant parts. Apply systemic fungicide (e.g., Mancozeb).
mr: लेट ब्लाईट: हा एक गंभीर रोग आहे. संक्रमित वनस्पतींचे भाग ताबडतोब काढून टाका आणि नष्ट करा. सिस्टिमिक फंगीसाईड (उदा. मॅनकोझेब) लावा.

source: Early Blight: Apply an approved copper fungicide immediately and ensure good air circulation.
mr: अर्ली ब्लाईट: मान्यताप्राप्त कॉपर फंगीसाईड ताबडतोब लावा आणि चांगली हवा खेळती राहील याची खात्री करा.

source: Prevention: Use certified disease-free seeds, practice crop rotation, and apply preventive sprays during wet weather.
mr: प्रतिबंध: प्रमाणित रोगमुक्त बियाणे वापरा, पीक फेरपालट करा आणि ओलसर हवामानात प्रतिबंधात्मक फवारण्या करा.

source: I'm sorry, I don't understand. Please ask about potato diseases or prevention.
mr: क्षमस्व, मला समजले नाही. कृपया बटाटा रोग किंवा प्रतिबंधाबद्दल विचारा.

source: Recent Scan Activity
mr: अलीकडील स्कॅन क्रियाकलाप
